** ブロックの基本

#+BEGIN_SRC ruby
def a_method(a, b)
  if block_given?
    a + yield(a, b)
  else
    a
  end
end
y=10
a_method(1,2) do |x| x+y end
  
#+END_SRC

#+RESULTS:
: 12

